app/controllers/events_controller.rb

INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ddd"], ["description", "eeee"], ["created_at", "2018-03-07 01:58:22.666612"], ["updated_at", "2018-03-07 01:58:22.666612"]]
---
  def create
    @event = Event.new(event_params)
    if @event.save

UPDATE "events" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "kiki"], ["description", "hihi\r\ni am kiki\r\nA cat"], ["updated_at", "2018-03-07 02:05:00.702620"], ["id", 3]]
---
  def update
    if @event.update(event_params)